index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>fipar.github.io</title>
<!-- 2015-07-19 Sun 13:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Fernando Ipar" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<h1 class="title">fipar.github.io</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Contact</a></li>
<li><a href="#sec-2">2. Work</a></li>
<li><a href="#sec-3">3. Blog</a></li>
<li><a href="#sec-4">4. Code</a></li>
<li><a href="#sec-5">5. Interests</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Contact</h2>
<div class="outline-text-2" id="text-1">
<p>
You can email me at fipar(at)acm(dot)org, or find me on freenode as
fipar or nandix.  
</p>

<p>
You can also contact me at <a href="http://linkedin.com/in/fipar">Linkedin</a>.
</p>

<p>
I am not on any other social network, though you will find people on
Twitter and Facebook with my same name, and also from Uruguay. You'd
be confused if you follow them expecting to get updates from me. 
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Work</h2>
<div class="outline-text-2" id="text-2">
<p>
I currently work at Percona as a <a href="https://www.percona.com/about-us/our-team/fernando-ipar">Senior Consultant</a>.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Blog</h2>
<div class="outline-text-2" id="text-3">
<p>
I have a <a href="http://fernandoipar.com">personal blog</a> (with mostly technical oriented content), and I
also contributed to <a href="https://www.percona.com/blog/author/fernando/">Percona's Blog</a>.
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Code</h2>
<div class="outline-text-2" id="text-4">
<p>
I have not been working as a full time programmer for a few years now,
but you can still find some repos with my code here: 
</p>
<ul class="org-ul">
<li><a href="http://github.com/fipar/">http://github.com/fipar/</a> 
</li>
<li><a href="https://launchpad.net/~fipar">https://launchpad.net/~fipar</a>
</li>
<li><a href="http://www.ohloh.net/accounts/nandix">http://www.ohloh.net/accounts/nandix</a>
</li>
<li><a href="http://sourceforge.net/users/fipar/">http://sourceforge.net/users/fipar/</a> (unmaintained)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Interests</h2>
<div class="outline-text-2" id="text-5">
<p>
I focus on Database Performance, with an emphasis on MySQL and
MongoDB, though I also work with other Open Source databases depending
on customer's needs. 
</p>

<p>
In relation to this, I am very interested in Systems Performance
Analysis, and I'm a big fan of <a href="http://brendangregg.com">Brendan Gregg</a> (for insight on analysis)
and <a href="http://www.edwardtufte.com/tufte/">Edward Tufte</a> (for insight on data visualization).  
</p>

<p>
I'm also very interested in programming. For the past few years, I have
mostly done that as part of consulting engagements, using bash, Ruby
and Go, but beyond my job, I engage in programming for fun, using
those languages, plus lisp (mostly CL and Clojure). I also enjoy
solving small problems (meaning things you can complete in a Saturday
morning) using other languages such as Erlang or Haskell, just to keep
the brain in shape. 
</p>

<p>
I'm a happy owner of a Boxed Set of Knuth's <a href="http://www-cs-faculty.stanford.edu/~uno/taocp.html">The Art of Computer
Programming</a>, and have been going through the exercises slowly, in my
spare time, for the last few years. I have mostly been focusing on
Volumes 1 and 3 for now. 
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Fernando Ipar</p>
<p class="date">Created: 2015-07-19 Sun 13:16</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.51.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>